<template>
    <vue-markdown>{{content}}</vue-markdown>
</template>

<script>
import VueMarkdown from 'vue-markdown'

const content = `
## flex-shrink ##

\`flex-shrink\` 设置元素在空间不足时的收缩系数

默认值为\`1\`

**计算公式：** 
- **溢出大小** = (元素1的大小 + 元素2的大小 + ...) - 容器宽度
- **总权重** = 元素1的大小 * 元素1的flexShrink的值 + 元素2的大小 * 元素2的flexShrink的值 + ...
- **元素n收缩大小** = 溢出大小 * 元素n的flexShrink的值 * 元素n的大小 / 总权重
- **元素n实际大小** = 元素n大小 - 元素n收缩大小
- (如果flexShrink值总和小于1, 收缩宽度还需要乘以flexShrink值总和)

比如当前页面的例子（flex-wrap为nowrap,flex-basis均为auto的情况下）
5个元素，每个元素原宽度都是100， 父元素为400，flexShrink的值均为1
溢出宽度 = 120 * 5 - 420 = 180
总权重 = (120 * 1) * 5 = 600
每个元素的收缩宽度 = 180 * 1 * 120 / 600 = 36
每个元素的宽度 = 120 - 20 = 84


如果flexShrink分别设置为 1, 2, 3, 2, 1，则：
溢出宽度 = 120 * 5 - 420 = 180
总权重 = 120 * (1+2+3+2+1)= 1080
元素1/5收缩宽度 = 180 * 1 * 120 / 1080 = 20
元素2/4收缩宽度 = 180 * 2 * 120 / 1080 = 40
元素3收缩宽度 = 180 * 3 * 120 / 1080 = 60
元素1/5的宽度 = 120 - 20 = 100
元素2/4的宽度 = 120 - 40 = 80
元素3的宽度 = 120 - 60 = 60

如果flexShrink分别设置为 0.1, 0.2, 0.3, 0.2, 0.1，则：
溢出宽度 = 120 * 5 - 420 = 180 
总权重 = 120 * (0.1+0.2+0.3+0.2+0.1)= 108
// 如果flexShrink值总和小于1, 收缩宽度还需要乘以flexShrink值总和
元素1/5收缩宽度 = 180 * (0.1+0.2+0.3+0.2+0.1) * 0.1 * 120 / 108 = 18
元素2/4收缩宽度 = 180 * (0.1+0.2+0.3+0.2+0.1) * 0.2 * 120 / 108 = 36
元素3收缩宽度 = 180 * (0.1+0.2+0.3+0.2+0.1) * 0.3 * 120 / 108 = 54
元素1/5的宽度 = 120 - 18 = 102
元素2/4的宽度 = 120 - 36 = 84
元素3的宽度 = 120 - 54 = 66
`

export default {
    data() {
        return {
            content,
        }
    },
    components: {
        VueMarkdown,
    }
}
</script>
